In [ ]:
%load_ext sql
import pandas as pd
import pyodbc
import sqlalchemy
import urllib

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
server_name = '####'  # If SQL Server is on the same machine
database_name = '####'
username = '####'
password = '####'

connection_string = f'DRIVER=ODBC Driver 17 for SQL Server;SERVER={server_name};DATABASE={database_name};UID={username};PWD={password}'
conn = pyodbc.connect(connection_string)

In [ ]:
#query='select top 10 * from pizza_sales'
#df=pd.read_sql(query,conn)
#df.head()

In [ ]:
#connection_string = "DRIVER={SQL SERVER};SERVER=server_name;DATABASE=database_name;TRUSTED_CONNECTION=YES;UID=username;PWD=password"
connection_str_quoted = urllib.parse.quote_plus(connection_string)
connection_uri = 'mssql+pyodbc:///?odbc_connect={}'.format(connection_str_quoted)
conn = sqlalchemy.create_engine(connection_uri)

%sql {connection_uri}

'Connected: @'

In [ ]:
%%sql
select top 5 * from pizza_sales

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[(1, 1, 'hawaiian_m', 1, datetime.date(2015, 1, 1), datetime.time(11, 38, 36), 13.25, 13.25, 'M', 'Classic', 'Sliced Ham, Pineapple, Mozzarella Cheese', 'The Hawaiian Pizza'),
 (2, 2, 'classic_dlx_m', 1, datetime.date(2015, 1, 1), datetime.time(11, 57, 40), 16.0, 16.0, 'M', 'Classic', 'Pepperoni, Mushrooms, Red Onions, Red Peppers, Bacon', 'The Classic Deluxe Pizza'),
 (3, 2, 'five_cheese_l', 1, datetime.date(2015, 1, 1), datetime.time(11, 57, 40), 18.5, 18.5, 'L', 'Veggie', 'Mozzarella Cheese, Provolone Cheese, Smoked Gouda Cheese, Romano Cheese, Blue Cheese, Garlic', 'The Five Cheese Pizza'),
 (4, 2, 'ital_supr_l', 1, datetime.date(2015, 1, 1), datetime.time(11, 57, 40), 20.75, 20.75, 'L', 'Supreme', 'Calabrese Salami, Capocollo, Tomatoes, Red Onions, Green Olives, Garlic', 'The Italian Supreme Pizza'),
 (5, 2, 'mexicana_m', 1, datetime.date(2015, 1, 1), datetime.time(11, 57, 40), 16.0, 16.0, 'M', 'Veggie', 'Tomatoes, Red Peppers, Jalapeno Peppers, Red Onions, Cilantro, Corn, Chipotle Sauce, Garlic', 'The Mexicana Pizza')]

### Total Revenue

In [ ]:
%%sql
select ROUND(SUM(total_price),2) as total_revenue from pizza_sales

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[(817860.05,)]

### Average order Value

In [ ]:
%%sql

SELECT ROUND(SUM(total_price)/COUNT(order_id),2) AS avg_order_value FROM pizza_sales

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[(16.82,)]

### Total pizza sold

In [ ]:
%%sql
SELECT SUM(quantity) as total_pizza_sold from pizza_sales

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[(49574,)]

### Total orders

In [ ]:
%%sql

SELECT COUNT( DISTINCT order_id) as total_order from pizza_sales

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[(21350,)]

### Average pizza per order

In [ ]:
%%sql

SELECT CAST(CAST(SUM(quantity) AS DECIMAL(10,2))/CAST(COUNT(DISTINCT order_id) AS DECIMAL(10,2)) AS DECIMAL(10,2)) AS avg_pizza_per_order from pizza_sales

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[(Decimal('2.32'),)]

### Daily Trend for total order

In [ ]:
%%sql

SELECT DATENAME(DW,order_date) as weekday, COUNT(DISTINCT order_id) as order_number
FROM pizza_sales
GROUP BY DATENAME(DW,order_date)

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('Saturday', 3158),
 ('Wednesday', 3024),
 ('Monday', 2794),
 ('Sunday', 2624),
 ('Friday', 3538),
 ('Thursday', 3239),
 ('Tuesday', 2973)]

<h3>Monthly trend for total order</h3>

In [ ]:
%%sql

SELECT DATENAME(MONTH,order_date) as Monthname, COUNT(DISTINCT order_id) as order_number
FROM pizza_sales
GROUP BY DATENAME(MONTH,order_date)

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('February', 1685),
 ('August', 1841),
 ('June', 1773),
 ('April', 1799),
 ('December', 1680),
 ('January', 1845),
 ('September', 1661),
 ('May', 1853),
 ('October', 1646),
 ('November', 1792),
 ('March', 1840),
 ('July', 1935)]

### Percentage of sales By pizza category

In [ ]:
%%sql

SELECT pizza_category, ROUND(SUM(total_price),2)as total_revenue,
ROUND(SUM(total_price)*100/(SELECT SUM(total_price) FROM pizza_sales),2) as PCT
FROM pizza_sales
GROUP BY pizza_category

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('Classic', 220053.1, 26.91),
 ('Chicken', 195919.5, 23.96),
 ('Veggie', 193690.45, 23.68),
 ('Supreme', 208197.0, 25.46)]

### Percentage of sales By pizza size

In [ ]:
%%sql
SELECT pizza_size,ROUND(SUM(total_price),2)as total_revenue,
ROUND(SUM(total_price)*100/(SELECT SUM(total_price) FROM pizza_sales),2) as PCT
FROM pizza_sales
GROUP BY pizza_size

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('L', 375318.7, 45.89),
 ('XXL', 1006.6, 0.12),
 ('M', 249382.25, 30.49),
 ('XL', 14076.0, 1.72),
 ('S', 178076.5, 21.77)]

### Total Pizzas Sold by Pizza Category

In [ ]:
%%sql

SELECT pizza_category, SUM(quantity)
FROM pizza_sales
GROUP BY pizza_category

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('Classic', 14888), ('Chicken', 11050), ('Veggie', 11649), ('Supreme', 11987)]

### Top 5 Pizzas by Revenue

In [ ]:
%%sql

SELECT TOP 5 pizza_name,ROUND(SUM(total_price),2) as revenue
FROM pizza_sales

group by pizza_name
ORDER BY revenue DESC

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('The Thai Chicken Pizza', 43434.25),
 ('The Barbecue Chicken Pizza', 42768.0),
 ('The California Chicken Pizza', 41409.5),
 ('The Classic Deluxe Pizza', 38180.5),
 ('The Spicy Italian Pizza', 34831.25)]

### Bottom 5 pizza  by Revenue

In [ ]:
%%sql

SELECT TOP 5 pizza_name,ROUND(SUM(total_price),2) as revenue
FROM pizza_sales

group by pizza_name
ORDER BY revenue ASC

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('The Brie Carre Pizza', 11588.5),
 ('The Green Garden Pizza', 13955.75),
 ('The Spinach Supreme Pizza', 15277.75),
 ('The Mediterranean Pizza', 15360.5),
 ('The Spinach Pesto Pizza', 15596.0)]

### Top 5 Pizzas by Quan�ty

In [ ]:
%%sql

SELECT TOP 5 pizza_name,ROUND(SUM(quantity),2) as quantity
FROM pizza_sales
group by pizza_name
ORDER BY quantity DESC

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('The Classic Deluxe Pizza', 2453),
 ('The Barbecue Chicken Pizza', 2432),
 ('The Hawaiian Pizza', 2422),
 ('The Pepperoni Pizza', 2418),
 ('The Thai Chicken Pizza', 2371)]

### Botom 5 Pizzas by Quan�ty

In [ ]:
%%sql

SELECT TOP 5 pizza_name,ROUND(SUM(quantity),2) as quantity
FROM pizza_sales
group by pizza_name
ORDER BY quantity ASC

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('The Brie Carre Pizza', 490),
 ('The Mediterranean Pizza', 934),
 ('The Calabrese Pizza', 937),
 ('The Spinach Supreme Pizza', 950),
 ('The Soppressata Pizza', 961)]

### Top 5 Pizzas by Total Orders

In [ ]:
%%sql
SELECT TOP 5 pizza_namE, COUNT(DISTINCT order_id) as order_count
FROM pizza_sales
group by pizza_name
ORDER BY order_count DESC

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('The Classic Deluxe Pizza', 2329),
 ('The Hawaiian Pizza', 2280),
 ('The Pepperoni Pizza', 2278),
 ('The Barbecue Chicken Pizza', 2273),
 ('The Thai Chicken Pizza', 2225)]

### Bottom 5 Pizzas by Total Orders

In [ ]:
%%sql
SELECT TOP 5 pizza_namE, COUNT(DISTINCT order_id) as order_count
FROM pizza_sales
group by pizza_name
ORDER BY order_count ASC

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('The Brie Carre Pizza', 480),
 ('The Mediterranean Pizza', 912),
 ('The Spinach Supreme Pizza', 918),
 ('The Calabrese Pizza', 918),
 ('The Chicken Pesto Pizza', 938)]

### Top 5 Pizzas by Total Orders ON SPECIFIC CATEGORY

In [ ]:
%%sql
SELECT TOP 5 pizza_namE, COUNT(DISTINCT order_id) as order_count
FROM pizza_sales
WHERE pizza_category='Supreme'
group by pizza_name
ORDER BY order_count DESC

 * mssql+pyodbc:///?odbc_connect=DRIVER%3DODBC+Driver+17+for+SQL+Server%3BSERVER%3Dmhpolas.database.windows.net%3BDATABASE%3Dsql_practice%3BUID%3Dmhpolas%3BPWD%3D%40VBHMAINULH786
Done.

[('The Spicy Italian Pizza', 1822),
 ('The Sicilian Pizza', 1820),
 ('The Italian Supreme Pizza', 1791),
 ('The Prosciutto and Arugula Pizza', 1398),
 ('The Pepper Salami Pizza', 1383)]